# -*- coding:utf-8


import random  # 随机


def 模具一一随机取名合并网址名():
    内容 = """柔蓉安蓝春语彤晴语菱霜紫莲翠烟南寻慕蕊雪海沛宛晓菡巧
            听卉靖枫梓晨丽丹佩惠月玉婉晓玲倩瑞静颖棋芹萍幻露灵含雅薇瑶丹丽云亿仪伊伶佳依俞俪倩偲兰冰凝凡凤叆呤
            爱姿惠娇媛妩萱娈瑷悠源赫晗贻楚梦琪忆柳桃慕兰岚香沛菡珊曼菱寒薇忆旋芷蕾代
            芙盼蝶筠瑶珍谷荷画嘉囡女如妃妍妙妮妹姐姑姗姝姞姣梅梦楠檀欢欣歆毓水洁涵淑清滟滢漪漫澜灵煜燕
            玉玥玫环玲珂珊珍珠姬娅娆娇娉娜娟娣娥娴婉婕婧婵婷媚媛嫔嫣嫱安宛宜宝容巧希彤彩心忆念怀怜思怡情惠
            慧敏旭春晴曼月琦琪琬琰琳琴琼瑗瑛瑜瑶瑾璇璐璟白盈盼碧秀筠红绮美翠艳芃芊芝芬芮芯芳芷芸苑若苹茗茜茵茹荔荭
            荷莉莎莲莹菁菡菲萍萱蓉蓓蔓蕊蕾薇诗语贞采钰银雅雨雪雯霏霖霜霞露青靖静音韵颖颜香馨黛"""

    内容 = 内容.replace("\n", "")
    内容 = 内容.replace(" ", "")

    名 = random.choice(内容)
    电影美剧表 = ['电影', '美剧']
    电影美剧名 = random.choice(电影美剧表)
    合名 = 名 + 电影美剧名 + '3e38丶com'
    合名 = 合名.replace(" ", "")

    print('随机取名合并网址名\n', 合名)
    return 合名  # 返回


模具一一随机取名合并网址名()

if 知乎发贴号 == 0:  # break # 结束循环 continue # 跳过当前循环,继续进行下一轮循环
    self.随机取名 = self.模具一一随机取女名()
else:  # 否则
